/**
  ******************************************************************************
  * @file    bsp_i2c_ee.c
  * @author  STMicroelectronics
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   鐢靛?瑙︽懜灞忕殑涓撶敤iic椹卞姩
  ******************************************************************************
  * @attention
  *
  * 瀹為獙骞冲彴:閲庣伀  STM32 F407 寮€鍙戞澘 
  * 璁哄潧    :http://www.firebbs.cn
  * 娣樺疂    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */

#include "bsp_i2c_touch.h"
#include "gt5xx.h"
#include "stm32f4xx_hal.h"
#include "tim.h"
extern TIM_HandleTypeDef htim7;
/* STM32 I2C 蹇?€熸ā寮? */
#define I2C_Speed 400000

/* 杩欎釜鍦板潃鍙??涓嶴TM32澶栨寕鐨処2C鍣ㄤ欢鍦板潃涓嶄竴鏍峰嵆鍙? */
#define I2C_OWN_ADDRESS7 0x0A

static void Delay(__IO uint32_t nCount) //绠€鍗曠殑寤舵椂鍑芥暟
{
	for (; nCount != 0; nCount--)
		;
}

/**
  * @brief  瀵笹T91xx鑺?墖杩涜?澶嶄綅
  * @param  鏃?
  * @retval 鏃?
  */
void I2C_ResetChip(void)
{

	// /*鍒濆?鍖朑T5688,rst涓洪珮鐢靛钩锛宨nt涓轰綆鐢靛钩锛屽垯gt5688鐨勮?澶囧湴鍧€琚?厤缃?负0xBA*/
	// HAL_Delay(50);
	/*澶嶄綅涓轰綆鐢靛钩锛屼负鍒濆?鍖栧仛鍑嗗?*/
	HAL_GPIO_WritePin(GTP_INT_GPIO_PORT, GTP_INT_GPIO_PIN, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GTP_RST_GPIO_PORT, GTP_RST_GPIO_PIN, GPIO_PIN_RESET);
	HAL_Delay(50);
	/*鎷夐珮涓€娈垫椂闂达紝杩涜?鍒濆?鍖?*/
	HAL_GPIO_WritePin(GTP_RST_GPIO_PORT, GTP_RST_GPIO_PIN, GPIO_PIN_SET);
	HAL_Delay(50);
}

/**
  * @brief  I2C 澶栬?(GT9xx)鍒濆?鍖?
  * @param  鏃?
  * @retval 鏃?
  */
void I2C_Touch_Init(void)
{
	I2C_ResetChip();
}
/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_Delay
*	鍔熻兘璇存槑: I2C鎬荤嚎浣嶅欢杩燂紝鏈€蹇?400KHz
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 鏃?
*********************************************************************************************************
*/
static void i2c_Delay(void)
{
	// uint8_t i;
	// uint16_t us;

	/*銆€
	 	涓嬮潰鐨勬椂闂存槸閫氳繃閫昏緫鍒嗘瀽浠?祴璇曞緱鍒扮殑銆?
    宸ヤ綔鏉′欢锛欳PU涓婚?180MHz 锛孧DK缂栬瘧鐜??锛?1绾т紭鍖?
      
		寰?幆娆℃暟涓?50鏃讹紝SCL棰戠巼 = 333KHz 
		寰?幆娆℃暟涓?30鏃讹紝SCL棰戠巼 = 533KHz锛?  
	 	寰?幆娆℃暟涓?20鏃讹紝SCL棰戠巼 = 727KHz锛? 
  */
	delay_us(5);
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_Start
*	鍔熻兘璇存槑: CPU鍙戣捣I2C鎬荤嚎鍚?姩淇″彿
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 鏃?
*********************************************************************************************************
*/
void i2c_Start(void)
{
	/* 褰揝CL楂樼數骞虫椂锛孲DA鍑虹幇涓€涓?笅璺虫部琛ㄧずI2C鎬荤嚎鍚?姩淇″彿 */
	I2C_SDA_1();
	I2C_SCL_1();
	i2c_Delay();
	I2C_SDA_0();
	i2c_Delay();
	I2C_SCL_0();
	i2c_Delay();
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_Start
*	鍔熻兘璇存槑: CPU鍙戣捣I2C鎬荤嚎鍋滄?淇″彿
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 鏃?
*********************************************************************************************************
*/
void i2c_Stop(void)
{
	/* 褰揝CL楂樼數骞虫椂锛孲DA鍑虹幇涓€涓?笂璺虫部琛ㄧずI2C鎬荤嚎鍋滄?淇″彿 */
	I2C_SDA_0();
	I2C_SCL_1();
	i2c_Delay();
	I2C_SDA_1();
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_SendByte
*	鍔熻兘璇存槑: CPU鍚慖2C鎬荤嚎璁惧?鍙戦€?8bit鏁版嵁
*	褰?    鍙傦細_ucByte 锛? 绛夊緟鍙戦€佺殑瀛楄妭
*	杩? 鍥? 鍊?: 鏃?
*********************************************************************************************************
*/
void i2c_SendByte(uint8_t _ucByte)
{
	uint8_t i;
	//SDA_OUT();
	/* 鍏堝彂閫佸瓧鑺傜殑楂樹綅bit7 */
	for (i = 0; i < 8; i++)
	{
		if (_ucByte & 0x80)
		{
			I2C_SDA_1();
		}
		else
		{
			I2C_SDA_0();
		}
		i2c_Delay();
		I2C_SCL_1();
		i2c_Delay();
		I2C_SCL_0();
		if (i == 7)
		{
			I2C_SDA_1(); // 閲婃斁鎬荤嚎
		}
		_ucByte <<= 1; /* 宸︾Щ涓€涓猙it */
		i2c_Delay();
	}
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_ReadByte
*	鍔熻兘璇存槑: CPU浠嶪2C鎬荤嚎璁惧?璇诲彇8bit鏁版嵁
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 璇诲埌鐨勬暟鎹?
*********************************************************************************************************
*/
uint8_t i2c_ReadByte(void)
{
	uint8_t i;
	uint8_t value;
	//SDA_IN();
	/* 璇诲埌绗?1涓猙it涓烘暟鎹?殑bit7 */
	value = 0;
	for (i = 0; i < 8; i++)
	{
		value <<= 1;
		I2C_SCL_1();
		i2c_Delay();
		if (I2C_SDA_READ())
		{
			value++;
		}
		I2C_SCL_0();
		i2c_Delay();
	}
	return value;
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_WaitAck
*	鍔熻兘璇存槑: CPU浜х敓涓€涓?椂閽燂紝骞惰?鍙栧櫒浠剁殑ACK搴旂瓟淇″彿
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 杩斿洖0琛ㄧず姝ｇ‘搴旂瓟锛?1琛ㄧず鏃犲櫒浠跺搷搴?
*********************************************************************************************************
*/
uint8_t i2c_WaitAck(void)
{
	uint8_t re;

	I2C_SDA_1(); /* CPU閲婃斁SDA鎬荤嚎 */
	i2c_Delay();
	I2C_SCL_1(); /* CPU椹卞姩SCL = 1, 姝ゆ椂鍣ㄤ欢浼氳繑鍥濧CK搴旂瓟 */
	i2c_Delay();
	// if (I2C_SDA_READ()) /* CPU璇诲彇SDA鍙ｇ嚎鐘舵€? */
	// {
	// 	re = 1;
	// }
	// else
	// {
	// 	re = 0;
	// }
	re = I2C_SDA_READ();
	//printf("I2C_SDA_READ=%d\r\n", re);
	I2C_SCL_0();
	i2c_Delay();
	return re;
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_Ack
*	鍔熻兘璇存槑: CPU浜х敓涓€涓狝CK淇″彿
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 鏃?
*********************************************************************************************************
*/
void i2c_Ack(void)
{
	I2C_SDA_0(); /* CPU椹卞姩SDA = 0 */
	i2c_Delay();
	I2C_SCL_1(); /* CPU浜х敓1涓?椂閽? */
	i2c_Delay();
	I2C_SCL_0();
	i2c_Delay();
	I2C_SDA_1(); /* CPU閲婃斁SDA鎬荤嚎 */
}

/*
*********************************************************************************************************
*	鍑? 鏁? 鍚?: i2c_NAck
*	鍔熻兘璇存槑: CPU浜х敓1涓狽ACK淇″彿
*	褰?    鍙傦細鏃?
*	杩? 鍥? 鍊?: 鏃?
*********************************************************************************************************
*/
void i2c_NAck(void)
{
	I2C_SDA_1(); /* CPU椹卞姩SDA = 1 */
	i2c_Delay();
	I2C_SCL_1(); /* CPU浜х敓1涓?椂閽? */
	i2c_Delay();
	I2C_SCL_0();
	i2c_Delay();
}

#define I2C_DIR_WR 0 /* 鍐欐帶鍒禸it */
#define I2C_DIR_RD 1 /* 璇绘帶鍒禸it */

/**
  * @brief   浣跨敤IIC璇诲彇鏁版嵁
  * @param   
  * 	@arg ClientAddr:浠庤?澶囧湴鍧€
  *		@arg pBuffer:瀛樻斁鐢变粠鏈鸿?鍙栫殑鏁版嵁鐨勭紦鍐插尯鎸囬拡
  *		@arg NumByteToRead:璇诲彇鐨勬暟鎹?暱搴?
  * @retval  鏃?
  */
uint32_t I2C_ReadBytes(uint8_t ClientAddr, uint8_t *pBuffer, uint16_t NumByteToRead)
{

	/* 绗?1姝ワ細鍙戣捣I2C鎬荤嚎鍚?姩淇″彿 */
	i2c_Start();

	/* 绗?2姝ワ細鍙戣捣鎺у埗瀛楄妭锛岄珮7bit鏄?湴鍧€锛宐it0鏄??鍐欐帶鍒朵綅锛?0琛ㄧず鍐欙紝1琛ㄧず璇? */
	i2c_SendByte(ClientAddr | I2C_DIR_RD); /* 姝ゅ?鏄??鎸囦护 */

	/* 绗?3姝ワ細绛夊緟ACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail; /* 鍣ㄤ欢鏃犲簲绛? */
	}

	while (NumByteToRead)
	{
		if (NumByteToRead == 1)
		{
			i2c_NAck(); /* 鏈€鍚?1涓?瓧鑺傝?瀹屽悗锛孋PU浜х敓NACK淇″彿(椹卞姩SDA = 1) */

			/* 鍙戦€両2C鎬荤嚎鍋滄?淇″彿 */
			i2c_Stop();
		}

		*pBuffer = i2c_ReadByte();

		/* 璇绘寚閽堣嚜澧? */
		pBuffer++;

		/*璁℃暟鍣ㄨ嚜鍑? */
		NumByteToRead--;

		i2c_Ack(); /* 涓?棿瀛楄妭璇诲畬鍚庯紝CPU浜х敓ACK淇″彿(椹卞姩SDA = 0) */
	}

	/* 鍙戦€両2C鎬荤嚎鍋滄?淇″彿 */
	i2c_Stop();
	return 0; /* 鎵ц?鎴愬姛 */

cmd_fail: /* 鍛戒护鎵ц?澶辫触鍚庯紝鍒囪?鍙戦€佸仠姝?俊鍙凤紝閬垮厤褰卞搷I2C鎬荤嚎涓婂叾浠栬?澶? */
	/* 鍙戦€両2C鎬荤嚎鍋滄?淇″彿 */
	i2c_Stop();
	return 1;
}

/**
  * @brief   浣跨敤IIC鍐欏叆鏁版嵁
  * @param   
  * 	@arg ClientAddr:浠庤?澶囧湴鍧€
  *		@arg pBuffer:缂撳啿鍖烘寚閽?
  *     @arg NumByteToWrite:鍐欑殑瀛楄妭鏁?
  * @retval  鏃?
  */
uint32_t I2C_WriteBytes(uint8_t ClientAddr, uint8_t *pBuffer, uint8_t NumByteToWrite)
{
	uint16_t m;

	/*銆€绗?0姝ワ細鍙戝仠姝?俊鍙凤紝鍚?姩鍐呴儴鍐欐搷浣溿€€*/
	i2c_Stop();

	/* 閫氳繃妫€鏌ュ櫒浠跺簲绛旂殑鏂瑰紡锛屽垽鏂?唴閮ㄥ啓鎿嶄綔鏄?惁瀹屾垚, 涓€鑸?皬浜? 10ms 			
    CLK棰戠巼涓?200KHz鏃讹紝鏌ヨ?娆℃暟涓?30娆″乏鍙?
  */
	for (m = 0; m < 1000; m++)
	{
		/* 绗?1姝ワ細鍙戣捣I2C鎬荤嚎鍚?姩淇″彿 */
		i2c_Start();

		/* 绗?2姝ワ細鍙戣捣鎺у埗瀛楄妭锛岄珮7bit鏄?湴鍧€锛宐it0鏄??鍐欐帶鍒朵綅锛?0琛ㄧず鍐欙紝1琛ㄧず璇? */
		i2c_SendByte(ClientAddr | I2C_DIR_WR); /* 姝ゅ?鏄?啓鎸囦护 */

		/* 绗?3姝ワ細鍙戦€佷竴涓?椂閽燂紝鍒ゆ柇鍣ㄤ欢鏄?惁姝ｇ‘搴旂瓟 */
		if (i2c_WaitAck() == 0)
		{
			break;
		}
	}
	if (m == 1000)
	{
		goto cmd_fail; /* EEPROM鍣ㄤ欢鍐欒秴鏃? */
	}

	while (NumByteToWrite--)
	{
		/* 绗?4姝ワ細寮€濮嬪啓鍏ユ暟鎹? */
		i2c_SendByte(*pBuffer);

		/* 绗?5姝ワ細妫€鏌?CK */
		if (i2c_WaitAck() != 0)
		{
			goto cmd_fail; /* 鍣ㄤ欢鏃犲簲绛? */
		}

		pBuffer++; /* 鍦板潃澧?1 */
	}

	/* 鍛戒护鎵ц?鎴愬姛锛屽彂閫両2C鎬荤嚎鍋滄?淇″彿 */
	i2c_Stop();
	return 0;

cmd_fail: /* 鍛戒护鎵ц?澶辫触鍚庯紝鍒囪?鍙戦€佸仠姝?俊鍙凤紝閬垮厤褰卞搷I2C鎬荤嚎涓婂叾浠栬?澶? */
	/* 鍙戦€両2C鎬荤嚎鍋滄?淇″彿 */
	i2c_Stop();
	return 1;
}

/*********************************************END OF FILE**********************/
